Repository: Majdos/42ptr-calc
Catalog: src/translations/*/LC_MESSAGES/messages.po
Languages: sk_sk

source: Division of 0 is undefined
sk_sk: Delenie nulou je nedefinované

source: Factorial: value must be positive integral value or zero
sk_sk: Faktorial: hodnota musí byť celé číslo a väčšie alebo rovné nule

source: ln: argument must be greater than 0
sk_sk: ln: argument musí byť väčší ako nula

source: sqrt: argument must be greater or equal zero
sk_sk: sqrt: argument musí byť väčší alebo rovný nule

source: root: first argument must be greater or equal zero
sk_sk: root: prvý argument musí byť väčší alebo rovný nule

source: root: second argument must be greater than zero
sk_sk: root: druhý argument musí byť väčší ako nula

source: Number must be in binary format
sk_sk: Číslo musú byť v binárnom formáte

source: Number must be in hexadecimal format
sk_sk: Číslo musú byť v hexadecimálnom formáte

source: Number must be in octal format
sk_sk: Číslo musú byť v oktálovom formáte

source: Enter expression
sk_sk: Zadajte výraz

source: Invalid expression
sk_sk: Neplatný výraz

source: Invalid identifier on position %d
sk_sk: Neplatný identifikátor na pozícii %d

source: Invalid comma
sk_sk: Nesprávne umiestnená čiarka

source: Mismatched parenthesis
sk_sk: Nesprávne uzátvorkovanie

source: Unknown character '%c'
sk_sk: Neznámy znak '%c'

source: Number already has decimal point
sk_sk: Číslo nesmie obsahovať viacej ako jednu desatinnú čiarku

source: Variable '%s' does not exist!
sk_sk: Premenná '%s' neexistuje!

source: Function '%s' does not exist!
sk_sk: Funkcia '%s' neexistuje!

source: Function '%s' is not correctly parenthesised
sk_sk: Funkcia '%s' nie je správne uzátvorkovaná

source: Unary operator %s does not exist
sk_sk: Unárny operátor %s neexistuje

source: Duplicate operator %s
sk_sk: Nesprávna sekvencia operátorov %s

source: Invalid factor
sk_sk: Nesprávny výraz
